type types = {
  label: string;
  value: string;
};

export const skillAccordion: types[] = [
  {
    label: "HTML / CSS",
    value:
      "規則性と整合性を意識したコーディングを行い、可読性と保守性を両立したコードを心がけています。開発環境には「Visual Studio Code」を使用し、拡張機能を活用することで作業効率を高めています。",
  },
  {
    label: "Sass",
    value:
      "スタイルの再利用性と管理性を高めるために、変数やネスト、mixinを活用した設計を行っています。保守性の高い構成を意識し、チーム開発でもスケーラブルなスタイル設計ができるよう工夫しています。",
  },
  {
    label: "Tailwind CSS",
    value:
      "ユーティリティクラスによる効率的なスタイリングを得意とし、デザインの再現性とスピードを両立しています。カスタムテーマやレスポンシブデザインにも柔軟に対応し、開発規模に応じた最適な運用も可能です。",
  },
  {
    label: "React",
    value:
      "コンポーネント指向の設計を意識し、再利用性・保守性の高いUI構築を行っています。Atomic Designを取り入れ、構造的でスケーラブルなデザイン設計を実現。状態管理やイベント制御を適切に行い、ユーザー体験を重視したインタラクティブな開発を行っています。",
  },
  {
    label: "Next.js",
    value:
      "Reactをベースに、パフォーマンスとSEOを両立した開発を行っています。App Routerやサーバーコンポーネントなどの最新機能を取り入れ、効率的で拡張性の高い実装が可能です。当サイトや個人開発にもNext.jsを採用し、実務を想定した開発経験を重ねています。",
  },
  {
    label: "TypeScript ",
    value:
      "型定義によるコードの安全性を重視し、エラーの早期発見や保守性の高い開発を行っています。ReactやNext.jsと組み合わせて使用し、スケーラブルで信頼性のあるアプリケーションを構築しています。",
  },
];
